docs: optimize all docs template;
